src/Catalogs/ВидыПиломатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыПиломатериалов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПиломатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПиломатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаШирины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаВысоты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПиломатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыПиломатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Брус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бревно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыПиломатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Перед записью следует сформировать наименование пиломатериала
// согласно выбранным параметрам.
//
Процедура СформироватьНаименование(ТекущийОбъект) Экспорт

	Если ТекущийОбъект.ТипПиломатериала <> Перечисления.ТипыПиломатериалов.ПустаяСсылка() Тогда
		
		ФорматЧисла = "ЧРД=,; ЧРГ=''''; ЧН=-; ЧГ=3,0";
		Рез = "";
		ЕдБазовая = Константы.БазоваяЕдиницаИзмерения.Получить();
		
		// Учитываем ширину
		//
		тШирина = ЕдиницыИзмеренияНаСервере.ПересчитатьЗначение(ТекущийОбъект.Ширина, ТекущийОбъект.ЕдиницаШирины, ЕдБазовая);
		Рез = Формат(тШирина, ФорматЧисла) + "*";
		
		// Учитываем высоту
		//
		Если ТекущийОбъект.ТипПиломатериала <> Перечисления.ТипыПиломатериалов.Бревно Тогда
			тВысота = ЕдиницыИзмеренияНаСервере.ПересчитатьЗначение(ТекущийОбъект.Высота, ТекущийОбъект.ЕдиницаВысоты, ЕдБазовая);
			Рез = Рез + Формат(тВысота, ФорматЧисла) + "*";
		КонецЕсли;
		
		// Учитываем длину
		//
		тДлина = ЕдиницыИзмеренияНаСервере.ПересчитатьЗначение(ТекущийОбъект.Длина, ТекущийОбъект.ЕдиницаДлины, ЕдБазовая);
		Рез = Рез + Формат(тДлина, ФорматЧисла);
		
		// Добавляем наименование типа
		//
		Рез = Строка(ТекущийОбъект.ТипПиломатериала) + " " + Рез + " " + Строка(ЕдБазовая);
		
		// Обновление значения наименования только при условии реального отличия
		//
		Если ТекущийОбъект.Наименование <> Рез Тогда
			ТекущийОбъект.Наименование = Рез;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // СформироватьНаименование

#КонецЕсли
